; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	thermograph0 - mode
	infrared1 - mode
	infrared2 - mode
	infrared4 - mode
	image3 - mode
	Star0 - direction
	GroundStation7 - direction
	Star51 - direction
	Star5 - direction
	Star55 - direction
	GroundStation57 - direction
	GroundStation4 - direction
	Star53 - direction
	GroundStation17 - direction
	Star37 - direction
	GroundStation47 - direction
	Star52 - direction
	GroundStation13 - direction
	Star30 - direction
	GroundStation44 - direction
	Star54 - direction
	Star28 - direction
	Star33 - direction
	Star40 - direction
	GroundStation2 - direction
	Star41 - direction
	Star19 - direction
	GroundStation18 - direction
	GroundStation48 - direction
	Star43 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Star12 - direction
	Star3 - direction
	GroundStation32 - direction
	Star25 - direction
	GroundStation58 - direction
	GroundStation35 - direction
	Star29 - direction
	Star38 - direction
	Star24 - direction
	Star56 - direction
	Star22 - direction
	GroundStation31 - direction
	Star15 - direction
	Star14 - direction
	Star1 - direction
	GroundStation45 - direction
	GroundStation49 - direction
	GroundStation20 - direction
	Star9 - direction
	Star23 - direction
	Star46 - direction
	Star21 - direction
	GroundStation26 - direction
	GroundStation39 - direction
	Star36 - direction
	GroundStation34 - direction
	Star16 - direction
	Star6 - direction
	Star10 - direction
	GroundStation27 - direction
	Star59 - direction
	Star50 - direction
	Star42 - direction
	Planet60 - direction
	Phenomenon61 - direction
	Planet62 - direction
	Planet63 - direction
	Star64 - direction
	Star65 - direction
	Planet66 - direction
	Phenomenon67 - direction
	Phenomenon68 - direction
	Planet69 - direction
	Phenomenon70 - direction
	Phenomenon71 - direction
	Planet72 - direction
	Phenomenon73 - direction
	Planet74 - direction
	Star75 - direction
	Phenomenon76 - direction
	Planet77 - direction
	Phenomenon78 - direction
	Star79 - direction
	Star80 - direction
	Phenomenon81 - direction
	Phenomenon82 - direction
	Phenomenon83 - direction
	Star84 - direction
	Planet85 - direction
	Planet86 - direction
	Phenomenon87 - direction
	Planet88 - direction
	Planet89 - direction
	Planet90 - direction
	Phenomenon91 - direction
	Planet92 - direction
	Star93 - direction
	Star94 - direction
	Planet95 - direction
	Phenomenon96 - direction
	Planet97 - direction
	Phenomenon98 - direction
	Phenomenon99 - direction
	Star100 - direction
	Phenomenon101 - direction
	Phenomenon102 - direction
	Phenomenon103 - direction
	Phenomenon104 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star55)
	(calibration_target instrument0 GroundStation57)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star53)
	(calibration_target instrument0 GroundStation18)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star79)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star54)
	(calibration_target instrument1 Star16)
	(calibration_target instrument1 Star15)
	(calibration_target instrument1 Star51)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation49)
	(calibration_target instrument1 Star30)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star46)
	(calibration_target instrument1 GroundStation35)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star21)
	(calibration_target instrument1 Star25)
	(calibration_target instrument1 GroundStation11)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation32)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star28)
	(calibration_target instrument2 Star46)
	(calibration_target instrument2 GroundStation17)
	(calibration_target instrument2 GroundStation45)
	(calibration_target instrument2 Star19)
	(calibration_target instrument2 Star33)
	(calibration_target instrument2 Star29)
	(calibration_target instrument2 Star56)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star16)
	(supports instrument3 infrared4)
	(supports instrument3 image3)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation48)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star24)
	(calibration_target instrument3 GroundStation34)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 GroundStation49)
	(calibration_target instrument3 GroundStation44)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation17)
	(calibration_target instrument3 Star46)
	(calibration_target instrument3 GroundStation57)
	(calibration_target instrument3 Star56)
	(calibration_target instrument3 Star40)
	(calibration_target instrument3 Star37)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star50)
	(calibration_target instrument3 Star53)
	(calibration_target instrument3 Star55)
	(supports instrument4 image3)
	(supports instrument4 infrared1)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 Star54)
	(calibration_target instrument4 GroundStation49)
	(calibration_target instrument4 Star52)
	(calibration_target instrument4 Star59)
	(calibration_target instrument4 GroundStation47)
	(calibration_target instrument4 Star50)
	(calibration_target instrument4 Star40)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star15)
	(calibration_target instrument4 Star37)
	(calibration_target instrument4 GroundStation17)
	(calibration_target instrument4 Star53)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star40)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 Star46)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon102)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation48)
	(calibration_target instrument6 GroundStation44)
	(calibration_target instrument6 Star30)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star50)
	(calibration_target instrument6 Star40)
	(supports instrument7 infrared4)
	(supports instrument7 image3)
	(calibration_target instrument7 Star28)
	(calibration_target instrument7 GroundStation34)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation18)
	(calibration_target instrument7 Star46)
	(calibration_target instrument7 Star10)
	(calibration_target instrument7 Star54)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon96)
	(supports instrument8 infrared1)
	(supports instrument8 infrared2)
	(supports instrument8 image3)
	(calibration_target instrument8 Star15)
	(calibration_target instrument8 GroundStation48)
	(calibration_target instrument8 GroundStation18)
	(calibration_target instrument8 Star12)
	(calibration_target instrument8 Star42)
	(calibration_target instrument8 Star19)
	(calibration_target instrument8 Star29)
	(calibration_target instrument8 GroundStation27)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star41)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation32)
	(calibration_target instrument8 Star43)
	(calibration_target instrument8 Star38)
	(calibration_target instrument8 Star40)
	(calibration_target instrument8 Star25)
	(calibration_target instrument8 Star33)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet60)
	(supports instrument9 image3)
	(calibration_target instrument9 Star56)
	(calibration_target instrument9 GroundStation11)
	(calibration_target instrument9 GroundStation8)
	(calibration_target instrument9 Star46)
	(calibration_target instrument9 Star25)
	(calibration_target instrument9 Star59)
	(calibration_target instrument9 Star43)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet85)
	(supports instrument10 image3)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 Star14)
	(calibration_target instrument10 Star50)
	(calibration_target instrument10 GroundStation27)
	(calibration_target instrument10 GroundStation32)
	(calibration_target instrument10 Star12)
	(calibration_target instrument10 GroundStation20)
	(calibration_target instrument10 GroundStation8)
	(supports instrument11 thermograph0)
	(supports instrument11 infrared4)
	(calibration_target instrument11 GroundStation31)
	(calibration_target instrument11 Star9)
	(calibration_target instrument11 Star46)
	(calibration_target instrument11 Star22)
	(calibration_target instrument11 Star56)
	(calibration_target instrument11 Star16)
	(calibration_target instrument11 Star15)
	(calibration_target instrument11 Star24)
	(calibration_target instrument11 GroundStation39)
	(calibration_target instrument11 GroundStation27)
	(calibration_target instrument11 Star38)
	(calibration_target instrument11 Star29)
	(calibration_target instrument11 GroundStation35)
	(calibration_target instrument11 GroundStation58)
	(calibration_target instrument11 Star1)
	(calibration_target instrument11 Star25)
	(calibration_target instrument11 GroundStation32)
	(supports instrument12 infrared4)
	(calibration_target instrument12 GroundStation26)
	(calibration_target instrument12 Star23)
	(calibration_target instrument12 Star59)
	(calibration_target instrument12 Star9)
	(calibration_target instrument12 GroundStation20)
	(calibration_target instrument12 GroundStation49)
	(calibration_target instrument12 GroundStation45)
	(calibration_target instrument12 Star1)
	(calibration_target instrument12 Star14)
	(calibration_target instrument12 Star15)
	(supports instrument13 infrared2)
	(supports instrument13 infrared1)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 Star42)
	(calibration_target instrument13 Star50)
	(calibration_target instrument13 Star59)
	(calibration_target instrument13 GroundStation27)
	(calibration_target instrument13 Star10)
	(calibration_target instrument13 Star6)
	(calibration_target instrument13 Star16)
	(calibration_target instrument13 GroundStation34)
	(calibration_target instrument13 Star36)
	(calibration_target instrument13 GroundStation39)
	(calibration_target instrument13 GroundStation26)
	(calibration_target instrument13 Star21)
	(calibration_target instrument13 Star46)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet60)
)
(:goal (and
	(pointing satellite1 Star53)
	(have_image Planet60 infrared1)
	(have_image Phenomenon61 infrared1)
	(have_image Planet62 thermograph0)
	(have_image Planet63 infrared1)
	(have_image Star64 infrared1)
	(have_image Star65 infrared2)
	(have_image Planet66 thermograph0)
	(have_image Phenomenon67 infrared2)
	(have_image Phenomenon68 image3)
	(have_image Planet69 thermograph0)
	(have_image Phenomenon70 infrared4)
	(have_image Phenomenon71 infrared4)
	(have_image Planet72 infrared4)
	(have_image Phenomenon73 infrared2)
	(have_image Planet74 thermograph0)
	(have_image Star75 infrared2)
	(have_image Phenomenon76 thermograph0)
	(have_image Planet77 thermograph0)
	(have_image Phenomenon78 thermograph0)
	(have_image Star79 infrared2)
	(have_image Star80 infrared2)
	(have_image Phenomenon81 infrared4)
	(have_image Phenomenon82 image3)
	(have_image Phenomenon83 thermograph0)
	(have_image Star84 thermograph0)
	(have_image Planet85 thermograph0)
	(have_image Planet86 infrared2)
	(have_image Phenomenon87 thermograph0)
	(have_image Planet88 thermograph0)
	(have_image Planet89 infrared4)
	(have_image Planet90 infrared4)
	(have_image Phenomenon91 infrared4)
	(have_image Planet92 infrared4)
	(have_image Star93 infrared2)
	(have_image Star94 image3)
	(have_image Planet95 infrared2)
	(have_image Phenomenon96 infrared4)
	(have_image Planet97 thermograph0)
	(have_image Phenomenon98 thermograph0)
	(have_image Phenomenon99 image3)
	(have_image Star100 thermograph0)
	(have_image Phenomenon101 thermograph0)
	(have_image Phenomenon102 infrared4)
	(have_image Phenomenon103 infrared2)
	(have_image Phenomenon104 image3)
))

)

; plan
1. (switch_on instrument11 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument11)
   goals met: 0 of 46
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 46
3. (turn_to satellite5 phenomenon101 planet60)
   deleted: (pointing satellite5 planet60)
   added: (pointing satellite5 phenomenon101)
   goals met: 0 of 46
4. (turn_to satellite1 star53 phenomenon102)
   deleted: (pointing satellite1 phenomenon102)
   added: (pointing satellite1 star53)
   goals met: 1 of 46
5. (turn_to satellite5 star9 phenomenon101)
   deleted: (pointing satellite5 phenomenon101)
   added: (pointing satellite5 star9)
   goals met: 1 of 46
6. (calibrate satellite5 instrument11 star9)
   added: (calibrated instrument11)
   goals met: 1 of 46
7. (turn_to satellite5 phenomenon101 star9)
   deleted: (pointing satellite5 star9)
   added: (pointing satellite5 phenomenon101)
   goals met: 1 of 46
8. (take_image satellite5 phenomenon101 instrument11 thermograph0)
   added: (have_image phenomenon101 thermograph0)
   goals met: 2 of 46
9. (turn_to satellite5 phenomenon102 phenomenon101)
   deleted: (pointing satellite5 phenomenon101)
   added: (pointing satellite5 phenomenon102)
   goals met: 2 of 46
10. (take_image satellite5 phenomenon102 instrument11 infrared4)
   added: (have_image phenomenon102 infrared4)
   goals met: 3 of 46
11. (turn_to satellite5 phenomenon70 phenomenon102)
   deleted: (pointing satellite5 phenomenon102)
   added: (pointing satellite5 phenomenon70)
   goals met: 3 of 46
12. (take_image satellite5 phenomenon70 instrument11 infrared4)
   added: (have_image phenomenon70 infrared4)
   goals met: 4 of 46
13. (turn_to satellite5 phenomenon71 phenomenon70)
   deleted: (pointing satellite5 phenomenon70)
   added: (pointing satellite5 phenomenon71)
   goals met: 4 of 46
14. (take_image satellite5 phenomenon71 instrument11 infrared4)
   added: (have_image phenomenon71 infrared4)
   goals met: 5 of 46
15. (turn_to satellite5 phenomenon76 phenomenon71)
   deleted: (pointing satellite5 phenomenon71)
   added: (pointing satellite5 phenomenon76)
   goals met: 5 of 46
16. (take_image satellite5 phenomenon76 instrument11 thermograph0)
   added: (have_image phenomenon76 thermograph0)
   goals met: 6 of 46
17. (turn_to satellite5 phenomenon78 phenomenon76)
   deleted: (pointing satellite5 phenomenon76)
   added: (pointing satellite5 phenomenon78)
   goals met: 6 of 46
18. (take_image satellite5 phenomenon78 instrument11 thermograph0)
   added: (have_image phenomenon78 thermograph0)
   goals met: 7 of 46
19. (turn_to satellite5 phenomenon81 phenomenon78)
   deleted: (pointing satellite5 phenomenon78)
   added: (pointing satellite5 phenomenon81)
   goals met: 7 of 46
20. (take_image satellite5 phenomenon81 instrument11 infrared4)
   added: (have_image phenomenon81 infrared4)
   goals met: 8 of 46
21. (turn_to satellite5 phenomenon83 phenomenon81)
   deleted: (pointing satellite5 phenomenon81)
   added: (pointing satellite5 phenomenon83)
   goals met: 8 of 46
22. (take_image satellite5 phenomenon83 instrument11 thermograph0)
   added: (have_image phenomenon83 thermograph0)
   goals met: 9 of 46
23. (turn_to satellite5 phenomenon87 phenomenon83)
   deleted: (pointing satellite5 phenomenon83)
   added: (pointing satellite5 phenomenon87)
   goals met: 9 of 46
24. (take_image satellite5 phenomenon87 instrument11 thermograph0)
   added: (have_image phenomenon87 thermograph0)
   goals met: 10 of 46
25. (turn_to satellite5 phenomenon91 phenomenon87)
   deleted: (pointing satellite5 phenomenon87)
   added: (pointing satellite5 phenomenon91)
   goals met: 10 of 46
26. (take_image satellite5 phenomenon91 instrument11 infrared4)
   added: (have_image phenomenon91 infrared4)
   goals met: 11 of 46
27. (turn_to satellite5 phenomenon96 phenomenon91)
   deleted: (pointing satellite5 phenomenon91)
   added: (pointing satellite5 phenomenon96)
   goals met: 11 of 46
28. (take_image satellite5 phenomenon96 instrument11 infrared4)
   added: (have_image phenomenon96 infrared4)
   goals met: 12 of 46
29. (turn_to satellite5 phenomenon98 phenomenon96)
   deleted: (pointing satellite5 phenomenon96)
   added: (pointing satellite5 phenomenon98)
   goals met: 12 of 46
30. (take_image satellite5 phenomenon98 instrument11 thermograph0)
   added: (have_image phenomenon98 thermograph0)
   goals met: 13 of 46
31. (turn_to satellite5 planet62 phenomenon98)
   deleted: (pointing satellite5 phenomenon98)
   added: (pointing satellite5 planet62)
   goals met: 13 of 46
32. (take_image satellite5 planet62 instrument11 thermograph0)
   added: (have_image planet62 thermograph0)
   goals met: 14 of 46
33. (turn_to satellite5 planet66 planet62)
   deleted: (pointing satellite5 planet62)
   added: (pointing satellite5 planet66)
   goals met: 14 of 46
34. (take_image satellite5 planet66 instrument11 thermograph0)
   added: (have_image planet66 thermograph0)
   goals met: 15 of 46
35. (turn_to satellite5 planet69 planet66)
   deleted: (pointing satellite5 planet66)
   added: (pointing satellite5 planet69)
   goals met: 15 of 46
36. (take_image satellite5 planet69 instrument11 thermograph0)
   added: (have_image planet69 thermograph0)
   goals met: 16 of 46
37. (turn_to satellite5 planet72 planet69)
   deleted: (pointing satellite5 planet69)
   added: (pointing satellite5 planet72)
   goals met: 16 of 46
38. (take_image satellite5 planet72 instrument11 infrared4)
   added: (have_image planet72 infrared4)
   goals met: 17 of 46
39. (turn_to satellite5 planet74 planet72)
   deleted: (pointing satellite5 planet72)
   added: (pointing satellite5 planet74)
   goals met: 17 of 46
40. (take_image satellite5 planet74 instrument11 thermograph0)
   added: (have_image planet74 thermograph0)
   goals met: 18 of 46
41. (turn_to satellite5 planet77 planet74)
   deleted: (pointing satellite5 planet74)
   added: (pointing satellite5 planet77)
   goals met: 18 of 46
42. (take_image satellite5 planet77 instrument11 thermograph0)
   added: (have_image planet77 thermograph0)
   goals met: 19 of 46
43. (turn_to satellite5 planet85 planet77)
   deleted: (pointing satellite5 planet77)
   added: (pointing satellite5 planet85)
   goals met: 19 of 46
44. (take_image satellite5 planet85 instrument11 thermograph0)
   added: (have_image planet85 thermograph0)
   goals met: 20 of 46
45. (turn_to satellite5 planet88 planet85)
   deleted: (pointing satellite5 planet85)
   added: (pointing satellite5 planet88)
   goals met: 20 of 46
46. (take_image satellite5 planet88 instrument11 thermograph0)
   added: (have_image planet88 thermograph0)
   goals met: 21 of 46
47. (turn_to satellite5 planet89 planet88)
   deleted: (pointing satellite5 planet88)
   added: (pointing satellite5 planet89)
   goals met: 21 of 46
48. (take_image satellite5 planet89 instrument11 infrared4)
   added: (have_image planet89 infrared4)
   goals met: 22 of 46
49. (turn_to satellite5 planet90 planet89)
   deleted: (pointing satellite5 planet89)
   added: (pointing satellite5 planet90)
   goals met: 22 of 46
50. (take_image satellite5 planet90 instrument11 infrared4)
   added: (have_image planet90 infrared4)
   goals met: 23 of 46
51. (turn_to satellite5 planet92 planet90)
   deleted: (pointing satellite5 planet90)
   added: (pointing satellite5 planet92)
   goals met: 23 of 46
52. (take_image satellite5 planet92 instrument11 infrared4)
   added: (have_image planet92 infrared4)
   goals met: 24 of 46
53. (turn_to satellite5 planet97 planet92)
   deleted: (pointing satellite5 planet92)
   added: (pointing satellite5 planet97)
   goals met: 24 of 46
54. (take_image satellite5 planet97 instrument11 thermograph0)
   added: (have_image planet97 thermograph0)
   goals met: 25 of 46
55. (turn_to satellite5 star100 planet97)
   deleted: (pointing satellite5 planet97)
   added: (pointing satellite5 star100)
   goals met: 25 of 46
56. (take_image satellite5 star100 instrument11 thermograph0)
   added: (have_image star100 thermograph0)
   goals met: 26 of 46
57. (turn_to satellite5 star84 star100)
   deleted: (pointing satellite5 star100)
   added: (pointing satellite5 star84)
   goals met: 26 of 46
58. (take_image satellite5 star84 instrument11 thermograph0)
   added: (have_image star84 thermograph0)
   goals met: 27 of 46
59. (turn_to satellite3 star6 planet60)
   deleted: (pointing satellite3 planet60)
   added: (pointing satellite3 star6)
   goals met: 27 of 46
60. (calibrate satellite3 instrument8 star6)
   added: (calibrated instrument8)
   goals met: 27 of 46
61. (turn_to satellite3 phenomenon103 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 phenomenon103)
   goals met: 27 of 46
62. (take_image satellite3 phenomenon103 instrument8 infrared2)
   added: (have_image phenomenon103 infrared2)
   goals met: 28 of 46
63. (turn_to satellite3 phenomenon104 phenomenon103)
   deleted: (pointing satellite3 phenomenon103)
   added: (pointing satellite3 phenomenon104)
   goals met: 28 of 46
64. (take_image satellite3 phenomenon104 instrument8 image3)
   added: (have_image phenomenon104 image3)
   goals met: 29 of 46
65. (turn_to satellite3 phenomenon61 phenomenon104)
   deleted: (pointing satellite3 phenomenon104)
   added: (pointing satellite3 phenomenon61)
   goals met: 29 of 46
66. (take_image satellite3 phenomenon61 instrument8 infrared1)
   added: (have_image phenomenon61 infrared1)
   goals met: 30 of 46
67. (turn_to satellite3 phenomenon67 phenomenon61)
   deleted: (pointing satellite3 phenomenon61)
   added: (pointing satellite3 phenomenon67)
   goals met: 30 of 46
68. (take_image satellite3 phenomenon67 instrument8 infrared2)
   added: (have_image phenomenon67 infrared2)
   goals met: 31 of 46
69. (turn_to satellite3 phenomenon68 phenomenon67)
   deleted: (pointing satellite3 phenomenon67)
   added: (pointing satellite3 phenomenon68)
   goals met: 31 of 46
70. (take_image satellite3 phenomenon68 instrument8 image3)
   added: (have_image phenomenon68 image3)
   goals met: 32 of 46
71. (turn_to satellite3 phenomenon73 phenomenon68)
   deleted: (pointing satellite3 phenomenon68)
   added: (pointing satellite3 phenomenon73)
   goals met: 32 of 46
72. (take_image satellite3 phenomenon73 instrument8 infrared2)
   added: (have_image phenomenon73 infrared2)
   goals met: 33 of 46
73. (turn_to satellite3 phenomenon82 phenomenon73)
   deleted: (pointing satellite3 phenomenon73)
   added: (pointing satellite3 phenomenon82)
   goals met: 33 of 46
74. (take_image satellite3 phenomenon82 instrument8 image3)
   added: (have_image phenomenon82 image3)
   goals met: 34 of 46
75. (turn_to satellite3 phenomenon99 phenomenon82)
   deleted: (pointing satellite3 phenomenon82)
   added: (pointing satellite3 phenomenon99)
   goals met: 34 of 46
76. (take_image satellite3 phenomenon99 instrument8 image3)
   added: (have_image phenomenon99 image3)
   goals met: 35 of 46
77. (turn_to satellite3 planet60 phenomenon99)
   deleted: (pointing satellite3 phenomenon99)
   added: (pointing satellite3 planet60)
   goals met: 35 of 46
78. (take_image satellite3 planet60 instrument8 infrared1)
   added: (have_image planet60 infrared1)
   goals met: 36 of 46
79. (turn_to satellite3 planet63 planet60)
   deleted: (pointing satellite3 planet60)
   added: (pointing satellite3 planet63)
   goals met: 36 of 46
80. (take_image satellite3 planet63 instrument8 infrared1)
   added: (have_image planet63 infrared1)
   goals met: 37 of 46
81. (turn_to satellite3 planet86 planet63)
   deleted: (pointing satellite3 planet63)
   added: (pointing satellite3 planet86)
   goals met: 37 of 46
82. (take_image satellite3 planet86 instrument8 infrared2)
   added: (have_image planet86 infrared2)
   goals met: 38 of 46
83. (turn_to satellite3 planet95 planet86)
   deleted: (pointing satellite3 planet86)
   added: (pointing satellite3 planet95)
   goals met: 38 of 46
84. (take_image satellite3 planet95 instrument8 infrared2)
   added: (have_image planet95 infrared2)
   goals met: 39 of 46
85. (turn_to satellite3 star64 planet95)
   deleted: (pointing satellite3 planet95)
   added: (pointing satellite3 star64)
   goals met: 39 of 46
86. (take_image satellite3 star64 instrument8 infrared1)
   added: (have_image star64 infrared1)
   goals met: 40 of 46
87. (turn_to satellite3 star65 star64)
   deleted: (pointing satellite3 star64)
   added: (pointing satellite3 star65)
   goals met: 40 of 46
88. (take_image satellite3 star65 instrument8 infrared2)
   added: (have_image star65 infrared2)
   goals met: 41 of 46
89. (turn_to satellite3 star75 star65)
   deleted: (pointing satellite3 star65)
   added: (pointing satellite3 star75)
   goals met: 41 of 46
90. (take_image satellite3 star75 instrument8 infrared2)
   added: (have_image star75 infrared2)
   goals met: 42 of 46
91. (turn_to satellite3 star79 star75)
   deleted: (pointing satellite3 star75)
   added: (pointing satellite3 star79)
   goals met: 42 of 46
92. (take_image satellite3 star79 instrument8 infrared2)
   added: (have_image star79 infrared2)
   goals met: 43 of 46
93. (turn_to satellite3 star80 star79)
   deleted: (pointing satellite3 star79)
   added: (pointing satellite3 star80)
   goals met: 43 of 46
94. (take_image satellite3 star80 instrument8 infrared2)
   added: (have_image star80 infrared2)
   goals met: 44 of 46
95. (turn_to satellite3 star93 star80)
   deleted: (pointing satellite3 star80)
   added: (pointing satellite3 star93)
   goals met: 44 of 46
96. (take_image satellite3 star93 instrument8 infrared2)
   added: (have_image star93 infrared2)
   goals met: 45 of 46
97. (turn_to satellite3 star94 star93)
   deleted: (pointing satellite3 star93)
   added: (pointing satellite3 star94)
   goals met: 45 of 46
98. (take_image satellite3 star94 instrument8 image3)
   added: (have_image star94 image3)
   goals met: 46 of 46
